
## Plan Result (img.cube-unit.net)

[CI link](https://github.com/shimosyan/cube-unit.net/actions/runs/16537063117)


<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * aws_cloudfront_distribution.s3_distribution
  * aws_s3_bucket_policy.policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.policy_document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::img.cube-unit.net",
              + "arn:aws:s3:::img.cube-unit.net/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::158677943024:distribution/E3KENKS175OARZ",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "E3KENKS175OARZ"
        tags                            = {}
        # (24 unchanged attributes hidden)

      + custom_error_response {
          + error_caching_min_ttl = 0
          + error_code            = 403
          + response_code         = 200
          + response_page_path    = "/redirect-to-404"
        }
      + custom_error_response {
          + error_caching_min_ttl = 0
          + error_code            = 404
          + response_code         = 200
          + response_page_path    = "/redirect-to-404"
        }

      ~ default_cache_behavior {
            # (16 unchanged attributes hidden)

          - function_association {
              - event_type   = "viewer-request" -> null
              - function_arn = "arn:aws:cloudfront::158677943024:function/cloudfront-s3-redirect" -> null
            }
          + function_association {
              + event_type   = "viewer-request"
              + function_arn = "arn:aws:cloudfront::158677943024:function/img-cube-unit-net-asset-redirect"
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "policy" {
        id     = "img.cube-unit.net"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceArn" = "arn:aws:cloudfront::158677943024:distribution/E3KENKS175OARZ"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::img.cube-unit.net/*",
                          - "arn:aws:s3:::img.cube-unit.net",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":17,"Program":"tfcmt","SHA1":"b0c92e4bc64782b99c6f576abb23ec197c00bdb6","Target":"img.cube-unit.net","Vars":{},"WorkflowName":"terraform-pull-request"} -->